performance_test/FIO/psync/android/core5.log
rand_read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process

rand_read: (groupid=0, jobs=1): err= 0: pid=13131: Mon Apr 21 16:25:04 2025
  read: IOPS=5379, BW=21.0MiB/s (22.0MB/s)(1051MiB/50001msec)
    clat (usec): min=118, max=22750, avg=184.58, stdev=172.39
     lat (usec): min=118, max=22750, avg=184.70, stdev=172.64
    clat percentiles (usec):
     |  1.00th=[  128],  5.00th=[  129], 10.00th=[  131], 20.00th=[  135],
     | 30.00th=[  139], 40.00th=[  155], 50.00th=[  161], 60.00th=[  172],
     | 70.00th=[  192], 80.00th=[  206], 90.00th=[  235], 95.00th=[  262],
     | 99.00th=[  545], 99.50th=[ 1057], 99.90th=[ 2245], 99.95th=[ 2737],
     | 99.99th=[ 7046]
   bw (  KiB/s): min=16296, max=24160, per=100.00%, avg=21532.64, stdev=1690.16, samples=99
   iops        : min= 4074, max= 6040, avg=5383.13, stdev=422.54, samples=99
  lat (usec)   : 250=93.51%, 500=5.43%, 750=0.24%, 1000=0.25%
  lat (msec)   : 2=0.43%, 4=0.10%, 10=0.02%, 20=0.01%, 50=0.01%
  cpu          : usr=0.47%, sys=6.82%, ctx=269242, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=268969,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=21.0MiB/s (22.0MB/s), 21.0MiB/s-21.0MiB/s (22.0MB/s-22.0MB/s), io=1051MiB (1102MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=268240/177, merge=0/349, ticks=47176/91, in_queue=47287, util=94.70%
rand_wr: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process

rand_wr: (groupid=0, jobs=1): err= 0: pid=13374: Mon Apr 21 16:25:54 2025
  write: IOPS=11.5k, BW=44.9MiB/s (47.1MB/s)(2244MiB/50002msec); 0 zone resets
    clat (usec): min=50, max=40395, avg=85.77, stdev=139.91
     lat (usec): min=50, max=40395, avg=85.97, stdev=140.14
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   62], 10.00th=[   63], 20.00th=[   64],
     | 30.00th=[   67], 40.00th=[   69], 50.00th=[   71], 60.00th=[   74],
     | 70.00th=[   79], 80.00th=[   86], 90.00th=[  100], 95.00th=[  118],
     | 99.00th=[  277], 99.50th=[  840], 99.90th=[ 1745], 99.95th=[ 2245],
     | 99.99th=[ 4621]
   bw (  KiB/s): min=37064, max=49048, per=100.00%, avg=46087.58, stdev=2438.40, samples=99
   iops        : min= 9266, max=12262, avg=11521.89, stdev=609.59, samples=99
  lat (usec)   : 100=90.05%, 250=8.88%, 500=0.31%, 750=0.20%, 1000=0.21%
  lat (msec)   : 2=0.28%, 4=0.06%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=1.11%, sys=14.38%, ctx=574758, majf=0, minf=7
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,574521,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=44.9MiB/s (47.1MB/s), 44.9MiB/s-44.9MiB/s (47.1MB/s-47.1MB/s), io=2244MiB (2353MB), run=50002-50002msec

Disk stats (read/write):
  vda: ios=0/573370, merge=0/399, ticks=0/44388, in_queue=44420, util=89.80%
rand_read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process

rand_read: (groupid=0, jobs=1): err= 0: pid=13636: Mon Apr 21 16:26:44 2025
  read: IOPS=5094, BW=19.9MiB/s (20.9MB/s)(995MiB/50001msec)
    clat (usec): min=118, max=19909, avg=195.01, stdev=167.05
     lat (usec): min=118, max=19909, avg=195.13, stdev=167.20
    clat percentiles (usec):
     |  1.00th=[  130],  5.00th=[  133], 10.00th=[  135], 20.00th=[  157],
     | 30.00th=[  159], 40.00th=[  163], 50.00th=[  169], 60.00th=[  182],
     | 70.00th=[  202], 80.00th=[  227], 90.00th=[  243], 95.00th=[  273],
     | 99.00th=[  537], 99.50th=[ 1004], 99.90th=[ 2114], 99.95th=[ 2442],
     | 99.99th=[ 7373]
   bw (  KiB/s): min=16664, max=21648, per=100.00%, avg=20386.40, stdev=839.43, samples=99
   iops        : min= 4166, max= 5412, avg=5096.59, stdev=209.89, samples=99
  lat (usec)   : 250=91.92%, 500=7.02%, 750=0.25%, 1000=0.30%
  lat (msec)   : 2=0.40%, 4=0.08%, 10=0.02%, 20=0.01%
  cpu          : usr=0.62%, sys=6.27%, ctx=254943, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=254710,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=19.9MiB/s (20.9MB/s), 19.9MiB/s-19.9MiB/s (20.9MB/s-20.9MB/s), io=995MiB (1043MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=253982/184, merge=0/412, ticks=47296/75, in_queue=47392, util=94.73%
rand_wr: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process

rand_wr: (groupid=0, jobs=1): err= 0: pid=13892: Mon Apr 21 16:27:35 2025
  write: IOPS=11.5k, BW=45.0MiB/s (47.2MB/s)(2248MiB/50001msec); 0 zone resets
    clat (usec): min=49, max=36552, avg=85.60, stdev=134.42
     lat (usec): min=50, max=36552, avg=85.80, stdev=134.71
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   62], 10.00th=[   63], 20.00th=[   64],
     | 30.00th=[   67], 40.00th=[   69], 50.00th=[   71], 60.00th=[   74],
     | 70.00th=[   79], 80.00th=[   85], 90.00th=[   99], 95.00th=[  117],
     | 99.00th=[  277], 99.50th=[  881], 99.90th=[ 1762], 99.95th=[ 2278],
     | 99.99th=[ 4293]
   bw (  KiB/s): min=36952, max=49224, per=100.00%, avg=46094.13, stdev=2539.80, samples=99
   iops        : min= 9238, max=12306, avg=11523.53, stdev=634.94, samples=99
  lat (usec)   : 50=0.01%, 100=90.42%, 250=8.53%, 500=0.28%, 750=0.19%
  lat (usec)   : 1000=0.22%
  lat (msec)   : 2=0.30%, 4=0.06%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=1.36%, sys=14.31%, ctx=575909, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,575604,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=45.0MiB/s (47.2MB/s), 45.0MiB/s-45.0MiB/s (47.2MB/s-47.2MB/s), io=2248MiB (2358MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=0/574149, merge=0/335, ticks=0/44596, in_queue=44636, util=89.48%
rand_read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process

rand_read: (groupid=0, jobs=1): err= 0: pid=14139: Mon Apr 21 16:28:25 2025
  read: IOPS=5191, BW=20.3MiB/s (21.3MB/s)(1014MiB/50001msec)
    clat (usec): min=119, max=15526, avg=191.31, stdev=165.41
     lat (usec): min=119, max=15526, avg=191.44, stdev=165.61
    clat percentiles (usec):
     |  1.00th=[  129],  5.00th=[  131], 10.00th=[  133], 20.00th=[  143],
     | 30.00th=[  159], 40.00th=[  161], 50.00th=[  167], 60.00th=[  178],
     | 70.00th=[  200], 80.00th=[  221], 90.00th=[  239], 95.00th=[  269],
     | 99.00th=[  502], 99.50th=[  988], 99.90th=[ 2089], 99.95th=[ 2442],
     | 99.99th=[ 6652]
   bw (  KiB/s): min=15120, max=22128, per=100.00%, avg=20768.36, stdev=943.03, samples=99
   iops        : min= 3780, max= 5532, avg=5192.09, stdev=235.76, samples=99
  lat (usec)   : 250=92.55%, 500=6.45%, 750=0.25%, 1000=0.27%
  lat (msec)   : 2=0.38%, 4=0.09%, 10=0.02%, 20=0.01%
  cpu          : usr=0.45%, sys=6.53%, ctx=259816, majf=0, minf=7
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=259572,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=20.3MiB/s (21.3MB/s), 20.3MiB/s-20.3MiB/s (21.3MB/s-21.3MB/s), io=1014MiB (1063MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=258804/178, merge=0/286, ticks=47317/64, in_queue=47397, util=94.75%
rand_wr: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process

rand_wr: (groupid=0, jobs=1): err= 0: pid=14405: Mon Apr 21 16:29:15 2025
  write: IOPS=11.5k, BW=44.7MiB/s (46.9MB/s)(2237MiB/50001msec); 0 zone resets
    clat (usec): min=50, max=20730, avg=86.01, stdev=136.25
     lat (usec): min=50, max=20731, avg=86.23, stdev=136.63
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   62], 10.00th=[   63], 20.00th=[   64],
     | 30.00th=[   67], 40.00th=[   69], 50.00th=[   71], 60.00th=[   74],
     | 70.00th=[   79], 80.00th=[   86], 90.00th=[  100], 95.00th=[  117],
     | 99.00th=[  277], 99.50th=[  873], 99.90th=[ 1827], 99.95th=[ 2278],
     | 99.99th=[ 4555]
   bw (  KiB/s): min=37664, max=49880, per=100.00%, avg=45825.93, stdev=2409.31, samples=99
   iops        : min= 9416, max=12470, avg=11456.47, stdev=602.33, samples=99
  lat (usec)   : 100=90.28%, 250=8.66%, 500=0.28%, 750=0.21%, 1000=0.20%
  lat (msec)   : 2=0.29%, 4=0.07%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=1.27%, sys=14.24%, ctx=573067, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,572775,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=44.7MiB/s (46.9MB/s), 44.7MiB/s-44.7MiB/s (46.9MB/s-46.9MB/s), io=2237MiB (2346MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=0/571311, merge=0/1346, ticks=0/44660, in_queue=44697, util=89.82%